HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEvadc_bf.h
/** \brief Offset for Ifx_EVADC_GLOB_RES_Bits.CHNR */
#define IFX_EVADC_GLOB_RES_CHNR_OFF (20u)

/** \brief Length for Ifx_EVADC_GLOB_RES_Bits.EMUX */
#define IFX_EVADC_GLOB_RES_EMUX_LEN (3u)

/** \brief Mask for Ifx_EVADC_GLOB_RES_Bits.EMUX */
#define IFX_EVADC_GLOB_RES_EMUX_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_GLOB_RES_Bits.EMUX */
#define IFX_EVADC_GLOB_RES_EMUX_OFF (25u)

/** \brief Length for Ifx_EVADC_GLOB_RES_Bits.CRS */
#define IFX_EVADC_GLOB_RES_CRS_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_RES_Bits.CRS */
#define IFX_EVADC_GLOB_RES_CRS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_RES_Bits.CRS */
#define IFX_EVADC_GLOB_RES_CRS_OFF (28u)

/** \brief Length for Ifx_EVADC_GLOB_RES_Bits.VF */
#define IFX_EVADC_GLOB_RES_VF_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_RES_Bits.VF */
#define IFX_EVADC_GLOB_RES_VF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_RES_Bits.VF */
#define IFX_EVADC_GLOB_RES_VF_OFF (31u)

/** \brief Length for Ifx_EVADC_GLOB_RESD_Bits.RESULT */
#define IFX_EVADC_GLOB_RESD_RESULT_LEN (16u)

/** \brief Mask for Ifx_EVADC_GLOB_RESD_Bits.RESULT */
#define IFX_EVADC_GLOB_RESD_RESULT_MSK (0xffffu)

/** \brief Offset for Ifx_EVADC_GLOB_RESD_Bits.RESULT */
#define IFX_EVADC_GLOB_RESD_RESULT_OFF (0u)

/** \brief Length for Ifx_EVADC_GLOB_RESD_Bits.GNR */
#define IFX_EVADC_GLOB_RESD_GNR_LEN (4u)

/** \brief Mask for Ifx_EVADC_GLOB_RESD_Bits.GNR */
#define IFX_EVADC_GLOB_RESD_GNR_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_GLOB_RESD_Bits.GNR */
#define IFX_EVADC_GLOB_RESD_GNR_OFF (16u)

/** \brief Length for Ifx_EVADC_GLOB_RESD_Bits.CHNR */
#define IFX_EVADC_GLOB_RESD_CHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_GLOB_RESD_Bits.CHNR */
#define IFX_EVADC_GLOB_RESD_CHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_GLOB_RESD_Bits.CHNR */
#define IFX_EVADC_GLOB_RESD_CHNR_OFF (20u)

/** \brief Length for Ifx_EVADC_GLOB_RESD_Bits.EMUX */
#define IFX_EVADC_GLOB_RESD_EMUX_LEN (3u)

/** \brief Mask for Ifx_EVADC_GLOB_RESD_Bits.EMUX */
#define IFX_EVADC_GLOB_RESD_EMUX_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_GLOB_RESD_Bits.EMUX */
#define IFX_EVADC_GLOB_RESD_EMUX_OFF (25u)

/** \brief Length for Ifx_EVADC_GLOB_RESD_Bits.CRS */
#define IFX_EVADC_GLOB_RESD_CRS_LEN (2u)

/** \brief Mask for Ifx_EVADC_GLOB_RESD_Bits.CRS */
#define IFX_EVADC_GLOB_RESD_CRS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_GLOB_RESD_Bits.CRS */
#define IFX_EVADC_GLOB_RESD_CRS_OFF (28u)

/** \brief Length for Ifx_EVADC_GLOB_RESD_Bits.VF */
#define IFX_EVADC_GLOB_RESD_VF_LEN (1u)

/** \brief Mask for Ifx_EVADC_GLOB_RESD_Bits.VF */
#define IFX_EVADC_GLOB_RESD_VF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_GLOB_RESD_Bits.VF */
#define IFX_EVADC_GLOB_RESD_VF_OFF (31u)

/** \brief Length for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_EVADC_EMUXSEL_EMUXGRP0_LEN (4u)

/** \brief Mask for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_EVADC_EMUXSEL_EMUXGRP0_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP0 */
#define IFX_EVADC_EMUXSEL_EMUXGRP0_OFF (0u)

/** \brief Length for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_EVADC_EMUXSEL_EMUXGRP1_LEN (4u)

/** \brief Mask for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_EVADC_EMUXSEL_EMUXGRP1_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_EMUXSEL_Bits.EMUXGRP1 */
#define IFX_EVADC_EMUXSEL_EMUXGRP1_OFF (4u)

/** \brief Length for Ifx_EVADC_G_TRCTR_Bits.TSC */
#define IFX_EVADC_G_TRCTR_TSC_LEN (6u)

/** \brief Mask for Ifx_EVADC_G_TRCTR_Bits.TSC */
#define IFX_EVADC_G_TRCTR_TSC_MSK (0x3fu)

/** \brief Offset for Ifx_EVADC_G_TRCTR_Bits.TSC */
#define IFX_EVADC_G_TRCTR_TSC_OFF (0u)

/** \brief Length for Ifx_EVADC_G_TRCTR_Bits.QACT */
#define IFX_EVADC_G_TRCTR_QACT_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_TRCTR_Bits.QACT */
#define IFX_EVADC_G_TRCTR_QACT_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_TRCTR_Bits.QACT */
#define IFX_EVADC_G_TRCTR_QACT_OFF (14u)

/** \brief Length for Ifx_EVADC_G_TRCTR_Bits.OV */
#define IFX_EVADC_G_TRCTR_OV_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_TRCTR_Bits.OV */
#define IFX_EVADC_G_TRCTR_OV_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_TRCTR_Bits.OV */
#define IFX_EVADC_G_TRCTR_OV_OFF (15u)

/** \brief Length for Ifx_EVADC_G_TRCTR_Bits.TSCSET */
#define IFX_EVADC_G_TRCTR_TSCSET_LEN (6u)

/** \brief Mask for Ifx_EVADC_G_TRCTR_Bits.TSCSET */
#define IFX_EVADC_G_TRCTR_TSCSET_MSK (0x3fu)

/** \brief Offset for Ifx_EVADC_G_TRCTR_Bits.TSCSET */
#define IFX_EVADC_G_TRCTR_TSCSET_OFF (16u)

/** \brief Length for Ifx_EVADC_G_TRCTR_Bits.ITSEL */
#define IFX_EVADC_G_TRCTR_ITSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_TRCTR_Bits.ITSEL */
#define IFX_EVADC_G_TRCTR_ITSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_TRCTR_Bits.ITSEL */
#define IFX_EVADC_G_TRCTR_ITSEL_OFF (24u)

/** \brief Length for Ifx_EVADC_G_TRCTR_Bits.SRDIS */
#define IFX_EVADC_G_TRCTR_SRDIS_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_TRCTR_Bits.SRDIS */
#define IFX_EVADC_G_TRCTR_SRDIS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_TRCTR_Bits.SRDIS */
#define IFX_EVADC_G_TRCTR_SRDIS_OFF (28u)

/** \brief Length for Ifx_EVADC_G_TRCTR_Bits.COV */
#define IFX_EVADC_G_TRCTR_COV_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_TRCTR_Bits.COV */
#define IFX_EVADC_G_TRCTR_COV_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_TRCTR_Bits.COV */
#define IFX_EVADC_G_TRCTR_COV_OFF (31u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.ANONC */
#define IFX_EVADC_G_ARBCFG_ANONC_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.ANONC */
#define IFX_EVADC_G_ARBCFG_ANONC_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.ANONC */
#define IFX_EVADC_G_ARBCFG_ANONC_OFF (0u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.ANONS */
#define IFX_EVADC_G_ARBCFG_ANONS_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.ANONS */
#define IFX_EVADC_G_ARBCFG_ANONS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.ANONS */
#define IFX_EVADC_G_ARBCFG_ANONS_OFF (16u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.CSRC */
#define IFX_EVADC_G_ARBCFG_CSRC_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.CSRC */
#define IFX_EVADC_G_ARBCFG_CSRC_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.CSRC */
#define IFX_EVADC_G_ARBCFG_CSRC_OFF (18u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.CHNR */
#define IFX_EVADC_G_ARBCFG_CHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.CHNR */
#define IFX_EVADC_G_ARBCFG_CHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.CHNR */
#define IFX_EVADC_G_ARBCFG_CHNR_OFF (20u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_EVADC_G_ARBCFG_SYNRUN_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_EVADC_G_ARBCFG_SYNRUN_MSK (0x1u)

