HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEvadc_bf.h
/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.SYNRUN */
#define IFX_EVADC_G_ARBCFG_SYNRUN_OFF (25u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.CAL */
#define IFX_EVADC_G_ARBCFG_CAL_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.CAL */
#define IFX_EVADC_G_ARBCFG_CAL_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.CAL */
#define IFX_EVADC_G_ARBCFG_CAL_OFF (28u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.BUSY */
#define IFX_EVADC_G_ARBCFG_BUSY_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.BUSY */
#define IFX_EVADC_G_ARBCFG_BUSY_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.BUSY */
#define IFX_EVADC_G_ARBCFG_BUSY_OFF (30u)

/** \brief Length for Ifx_EVADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_EVADC_G_ARBCFG_SAMPLE_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_EVADC_G_ARBCFG_SAMPLE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBCFG_Bits.SAMPLE */
#define IFX_EVADC_G_ARBCFG_SAMPLE_OFF (31u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.PRIO0 */
#define IFX_EVADC_G_ARBPR_PRIO0_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.PRIO0 */
#define IFX_EVADC_G_ARBPR_PRIO0_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.PRIO0 */
#define IFX_EVADC_G_ARBPR_PRIO0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.CSM0 */
#define IFX_EVADC_G_ARBPR_CSM0_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.CSM0 */
#define IFX_EVADC_G_ARBPR_CSM0_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.CSM0 */
#define IFX_EVADC_G_ARBPR_CSM0_OFF (3u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.PRIO1 */
#define IFX_EVADC_G_ARBPR_PRIO1_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.PRIO1 */
#define IFX_EVADC_G_ARBPR_PRIO1_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.PRIO1 */
#define IFX_EVADC_G_ARBPR_PRIO1_OFF (4u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.CSM1 */
#define IFX_EVADC_G_ARBPR_CSM1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.CSM1 */
#define IFX_EVADC_G_ARBPR_CSM1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.CSM1 */
#define IFX_EVADC_G_ARBPR_CSM1_OFF (7u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.PRIO2 */
#define IFX_EVADC_G_ARBPR_PRIO2_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.PRIO2 */
#define IFX_EVADC_G_ARBPR_PRIO2_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.PRIO2 */
#define IFX_EVADC_G_ARBPR_PRIO2_OFF (8u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.CSM2 */
#define IFX_EVADC_G_ARBPR_CSM2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.CSM2 */
#define IFX_EVADC_G_ARBPR_CSM2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.CSM2 */
#define IFX_EVADC_G_ARBPR_CSM2_OFF (11u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.ASEN0 */
#define IFX_EVADC_G_ARBPR_ASEN0_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.ASEN0 */
#define IFX_EVADC_G_ARBPR_ASEN0_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.ASEN0 */
#define IFX_EVADC_G_ARBPR_ASEN0_OFF (24u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.ASEN1 */
#define IFX_EVADC_G_ARBPR_ASEN1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.ASEN1 */
#define IFX_EVADC_G_ARBPR_ASEN1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.ASEN1 */
#define IFX_EVADC_G_ARBPR_ASEN1_OFF (25u)

/** \brief Length for Ifx_EVADC_G_ARBPR_Bits.ASEN2 */
#define IFX_EVADC_G_ARBPR_ASEN2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ARBPR_Bits.ASEN2 */
#define IFX_EVADC_G_ARBPR_ASEN2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ARBPR_Bits.ASEN2 */
#define IFX_EVADC_G_ARBPR_ASEN2_OFF (26u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.IPE */
#define IFX_EVADC_G_ANCFG_IPE_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.IPE */
#define IFX_EVADC_G_ANCFG_IPE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.IPE */
#define IFX_EVADC_G_ANCFG_IPE_OFF (0u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.BE */
#define IFX_EVADC_G_ANCFG_BE_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.BE */
#define IFX_EVADC_G_ANCFG_BE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.BE */
#define IFX_EVADC_G_ANCFG_BE_OFF (1u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.RPE */
#define IFX_EVADC_G_ANCFG_RPE_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.RPE */
#define IFX_EVADC_G_ANCFG_RPE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.RPE */
#define IFX_EVADC_G_ANCFG_RPE_OFF (2u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.RPC */
#define IFX_EVADC_G_ANCFG_RPC_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.RPC */
#define IFX_EVADC_G_ANCFG_RPC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.RPC */
#define IFX_EVADC_G_ANCFG_RPC_OFF (3u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.CALSTC */
#define IFX_EVADC_G_ANCFG_CALSTC_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.CALSTC */
#define IFX_EVADC_G_ANCFG_CALSTC_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.CALSTC */
#define IFX_EVADC_G_ANCFG_CALSTC_OFF (4u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.DPCAL */
#define IFX_EVADC_G_ANCFG_DPCAL_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.DPCAL */
#define IFX_EVADC_G_ANCFG_DPCAL_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.DPCAL */
#define IFX_EVADC_G_ANCFG_DPCAL_OFF (6u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.ACSD */
#define IFX_EVADC_G_ANCFG_ACSD_LEN (3u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.ACSD */
#define IFX_EVADC_G_ANCFG_ACSD_MSK (0x7u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.ACSD */
#define IFX_EVADC_G_ANCFG_ACSD_OFF (16u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.SSE */
#define IFX_EVADC_G_ANCFG_SSE_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.SSE */
#define IFX_EVADC_G_ANCFG_SSE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.SSE */
#define IFX_EVADC_G_ANCFG_SSE_OFF (19u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.DIVA */
#define IFX_EVADC_G_ANCFG_DIVA_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.DIVA */
#define IFX_EVADC_G_ANCFG_DIVA_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.DIVA */
#define IFX_EVADC_G_ANCFG_DIVA_OFF (20u)

/** \brief Length for Ifx_EVADC_G_ANCFG_Bits.DCMSB */
#define IFX_EVADC_G_ANCFG_DCMSB_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ANCFG_Bits.DCMSB */
#define IFX_EVADC_G_ANCFG_DCMSB_MSK (0x1u)

