HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEvadc_bf.h
/** \brief Offset for Ifx_EVADC_G_ANCFG_Bits.DCMSB */
#define IFX_EVADC_G_ANCFG_DCMSB_OFF (25u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.STCS */
#define IFX_EVADC_G_ICLASS_STCS_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.STCS */
#define IFX_EVADC_G_ICLASS_STCS_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.STCS */
#define IFX_EVADC_G_ICLASS_STCS_OFF (0u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.AIPS */
#define IFX_EVADC_G_ICLASS_AIPS_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.AIPS */
#define IFX_EVADC_G_ICLASS_AIPS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.AIPS */
#define IFX_EVADC_G_ICLASS_AIPS_OFF (6u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.CMS */
#define IFX_EVADC_G_ICLASS_CMS_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.CMS */
#define IFX_EVADC_G_ICLASS_CMS_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.CMS */
#define IFX_EVADC_G_ICLASS_CMS_OFF (8u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.SESPS */
#define IFX_EVADC_G_ICLASS_SESPS_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.SESPS */
#define IFX_EVADC_G_ICLASS_SESPS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.SESPS */
#define IFX_EVADC_G_ICLASS_SESPS_OFF (10u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.STCE */
#define IFX_EVADC_G_ICLASS_STCE_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.STCE */
#define IFX_EVADC_G_ICLASS_STCE_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.STCE */
#define IFX_EVADC_G_ICLASS_STCE_OFF (16u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.AIPE */
#define IFX_EVADC_G_ICLASS_AIPE_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.AIPE */
#define IFX_EVADC_G_ICLASS_AIPE_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.AIPE */
#define IFX_EVADC_G_ICLASS_AIPE_OFF (22u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.CME */
#define IFX_EVADC_G_ICLASS_CME_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.CME */
#define IFX_EVADC_G_ICLASS_CME_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.CME */
#define IFX_EVADC_G_ICLASS_CME_OFF (24u)

/** \brief Length for Ifx_EVADC_G_ICLASS_Bits.SESPE */
#define IFX_EVADC_G_ICLASS_SESPE_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_ICLASS_Bits.SESPE */
#define IFX_EVADC_G_ICLASS_SESPE_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_ICLASS_Bits.SESPE */
#define IFX_EVADC_G_ICLASS_SESPE_OFF (26u)

/** \brief Length for Ifx_EVADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_EVADC_G_ALIAS_ALIAS0_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_EVADC_G_ALIAS_ALIAS0_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_ALIAS_Bits.ALIAS0 */
#define IFX_EVADC_G_ALIAS_ALIAS0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_EVADC_G_ALIAS_ALIAS1_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_EVADC_G_ALIAS_ALIAS1_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_ALIAS_Bits.ALIAS1 */
#define IFX_EVADC_G_ALIAS_ALIAS1_OFF (8u)

/** \brief Length for Ifx_EVADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_G_BOUND_BOUNDARY0_LEN (12u)

/** \brief Mask for Ifx_EVADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_G_BOUND_BOUNDARY0_MSK (0xfffu)

/** \brief Offset for Ifx_EVADC_G_BOUND_Bits.BOUNDARY0 */
#define IFX_EVADC_G_BOUND_BOUNDARY0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_G_BOUND_BOUNDARY1_LEN (12u)

/** \brief Mask for Ifx_EVADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_G_BOUND_BOUNDARY1_MSK (0xfffu)

/** \brief Offset for Ifx_EVADC_G_BOUND_Bits.BOUNDARY1 */
#define IFX_EVADC_G_BOUND_BOUNDARY1_OFF (16u)

/** \brief Length for Ifx_EVADC_G_SYNCTR_Bits.STSEL */
#define IFX_EVADC_G_SYNCTR_STSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_SYNCTR_Bits.STSEL */
#define IFX_EVADC_G_SYNCTR_STSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_SYNCTR_Bits.STSEL */
#define IFX_EVADC_G_SYNCTR_STSEL_OFF (0u)

/** \brief Length for Ifx_EVADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_EVADC_G_SYNCTR_EVALR1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_EVADC_G_SYNCTR_EVALR1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SYNCTR_Bits.EVALR1 */
#define IFX_EVADC_G_SYNCTR_EVALR1_OFF (4u)

/** \brief Length for Ifx_EVADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_EVADC_G_SYNCTR_EVALR2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_EVADC_G_SYNCTR_EVALR2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SYNCTR_Bits.EVALR2 */
#define IFX_EVADC_G_SYNCTR_EVALR2_OFF (5u)

/** \brief Length for Ifx_EVADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_EVADC_G_SYNCTR_EVALR3_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_EVADC_G_SYNCTR_EVALR3_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SYNCTR_Bits.EVALR3 */
#define IFX_EVADC_G_SYNCTR_EVALR3_OFF (6u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.SRCRESREG */
#define IFX_EVADC_G_Q_QCTRL_SRCRESREG_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.SRCRESREG */
#define IFX_EVADC_G_Q_QCTRL_SRCRESREG_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.SRCRESREG */
#define IFX_EVADC_G_Q_QCTRL_SRCRESREG_OFF (0u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.TRSEL */
#define IFX_EVADC_G_Q_QCTRL_TRSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.TRSEL */
#define IFX_EVADC_G_Q_QCTRL_TRSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.TRSEL */
#define IFX_EVADC_G_Q_QCTRL_TRSEL_OFF (6u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.XTSEL */
#define IFX_EVADC_G_Q_QCTRL_XTSEL_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.XTSEL */
#define IFX_EVADC_G_Q_QCTRL_XTSEL_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.XTSEL */
#define IFX_EVADC_G_Q_QCTRL_XTSEL_OFF (8u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.XTLVL */
#define IFX_EVADC_G_Q_QCTRL_XTLVL_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.XTLVL */
#define IFX_EVADC_G_Q_QCTRL_XTLVL_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.XTLVL */
#define IFX_EVADC_G_Q_QCTRL_XTLVL_OFF (12u)

