HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEvadc_bf.h
/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.XTMODE */
#define IFX_EVADC_G_Q_QCTRL_XTMODE_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.XTMODE */
#define IFX_EVADC_G_Q_QCTRL_XTMODE_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.XTMODE */
#define IFX_EVADC_G_Q_QCTRL_XTMODE_OFF (13u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.XTWC */
#define IFX_EVADC_G_Q_QCTRL_XTWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.XTWC */
#define IFX_EVADC_G_Q_QCTRL_XTWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.XTWC */
#define IFX_EVADC_G_Q_QCTRL_XTWC_OFF (15u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.GTSEL */
#define IFX_EVADC_G_Q_QCTRL_GTSEL_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.GTSEL */
#define IFX_EVADC_G_Q_QCTRL_GTSEL_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.GTSEL */
#define IFX_EVADC_G_Q_QCTRL_GTSEL_OFF (16u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.GTLVL */
#define IFX_EVADC_G_Q_QCTRL_GTLVL_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.GTLVL */
#define IFX_EVADC_G_Q_QCTRL_GTLVL_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.GTLVL */
#define IFX_EVADC_G_Q_QCTRL_GTLVL_OFF (20u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.GTWC */
#define IFX_EVADC_G_Q_QCTRL_GTWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.GTWC */
#define IFX_EVADC_G_Q_QCTRL_GTWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.GTWC */
#define IFX_EVADC_G_Q_QCTRL_GTWC_OFF (23u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.TMEN */
#define IFX_EVADC_G_Q_QCTRL_TMEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.TMEN */
#define IFX_EVADC_G_Q_QCTRL_TMEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.TMEN */
#define IFX_EVADC_G_Q_QCTRL_TMEN_OFF (28u)

/** \brief Length for Ifx_EVADC_G_Q_QCTRL_Bits.TMWC */
#define IFX_EVADC_G_Q_QCTRL_TMWC_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QCTRL_Bits.TMWC */
#define IFX_EVADC_G_Q_QCTRL_TMWC_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QCTRL_Bits.TMWC */
#define IFX_EVADC_G_Q_QCTRL_TMWC_OFF (31u)

/** \brief Length for Ifx_EVADC_G_Q_QMR_Bits.ENGT */
#define IFX_EVADC_G_Q_QMR_ENGT_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_Q_QMR_Bits.ENGT */
#define IFX_EVADC_G_Q_QMR_ENGT_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_Q_QMR_Bits.ENGT */
#define IFX_EVADC_G_Q_QMR_ENGT_OFF (0u)

/** \brief Length for Ifx_EVADC_G_Q_QMR_Bits.ENTR */
#define IFX_EVADC_G_Q_QMR_ENTR_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QMR_Bits.ENTR */
#define IFX_EVADC_G_Q_QMR_ENTR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QMR_Bits.ENTR */
#define IFX_EVADC_G_Q_QMR_ENTR_OFF (2u)

/** \brief Length for Ifx_EVADC_G_Q_QMR_Bits.CLRV */
#define IFX_EVADC_G_Q_QMR_CLRV_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QMR_Bits.CLRV */
#define IFX_EVADC_G_Q_QMR_CLRV_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QMR_Bits.CLRV */
#define IFX_EVADC_G_Q_QMR_CLRV_OFF (8u)

/** \brief Length for Ifx_EVADC_G_Q_QMR_Bits.TREV */
#define IFX_EVADC_G_Q_QMR_TREV_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QMR_Bits.TREV */
#define IFX_EVADC_G_Q_QMR_TREV_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QMR_Bits.TREV */
#define IFX_EVADC_G_Q_QMR_TREV_OFF (9u)

/** \brief Length for Ifx_EVADC_G_Q_QMR_Bits.FLUSH */
#define IFX_EVADC_G_Q_QMR_FLUSH_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QMR_Bits.FLUSH */
#define IFX_EVADC_G_Q_QMR_FLUSH_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QMR_Bits.FLUSH */
#define IFX_EVADC_G_Q_QMR_FLUSH_OFF (10u)

/** \brief Length for Ifx_EVADC_G_Q_QMR_Bits.CEV */
#define IFX_EVADC_G_Q_QMR_CEV_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QMR_Bits.CEV */
#define IFX_EVADC_G_Q_QMR_CEV_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QMR_Bits.CEV */
#define IFX_EVADC_G_Q_QMR_CEV_OFF (11u)

/** \brief Length for Ifx_EVADC_G_Q_QMR_Bits.RPTDIS */
#define IFX_EVADC_G_Q_QMR_RPTDIS_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QMR_Bits.RPTDIS */
#define IFX_EVADC_G_Q_QMR_RPTDIS_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QMR_Bits.RPTDIS */
#define IFX_EVADC_G_Q_QMR_RPTDIS_OFF (16u)

/** \brief Length for Ifx_EVADC_G_Q_QSR_Bits.FILL */
#define IFX_EVADC_G_Q_QSR_FILL_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_Q_QSR_Bits.FILL */
#define IFX_EVADC_G_Q_QSR_FILL_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_Q_QSR_Bits.FILL */
#define IFX_EVADC_G_Q_QSR_FILL_OFF (0u)

/** \brief Length for Ifx_EVADC_G_Q_QSR_Bits.EMPTY */
#define IFX_EVADC_G_Q_QSR_EMPTY_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QSR_Bits.EMPTY */
#define IFX_EVADC_G_Q_QSR_EMPTY_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QSR_Bits.EMPTY */
#define IFX_EVADC_G_Q_QSR_EMPTY_OFF (5u)

/** \brief Length for Ifx_EVADC_G_Q_QSR_Bits.REQGT */
#define IFX_EVADC_G_Q_QSR_REQGT_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QSR_Bits.REQGT */
#define IFX_EVADC_G_Q_QSR_REQGT_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QSR_Bits.REQGT */
#define IFX_EVADC_G_Q_QSR_REQGT_OFF (7u)

/** \brief Length for Ifx_EVADC_G_Q_QSR_Bits.EV */
#define IFX_EVADC_G_Q_QSR_EV_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QSR_Bits.EV */
#define IFX_EVADC_G_Q_QSR_EV_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QSR_Bits.EV */
#define IFX_EVADC_G_Q_QSR_EV_OFF (8u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.REQCHNR */
#define IFX_EVADC_G_Q_Q0R_REQCHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.REQCHNR */
#define IFX_EVADC_G_Q_Q0R_REQCHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.REQCHNR */
#define IFX_EVADC_G_Q_Q0R_REQCHNR_OFF (0u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.RF */
#define IFX_EVADC_G_Q_Q0R_RF_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.RF */
#define IFX_EVADC_G_Q_Q0R_RF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.RF */
#define IFX_EVADC_G_Q_Q0R_RF_OFF (5u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.ENSI */
#define IFX_EVADC_G_Q_Q0R_ENSI_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.ENSI */
#define IFX_EVADC_G_Q_Q0R_ENSI_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.ENSI */
#define IFX_EVADC_G_Q_Q0R_ENSI_OFF (6u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.EXTR */
#define IFX_EVADC_G_Q_Q0R_EXTR_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.EXTR */
#define IFX_EVADC_G_Q_Q0R_EXTR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.EXTR */
#define IFX_EVADC_G_Q_Q0R_EXTR_OFF (7u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.V */
#define IFX_EVADC_G_Q_Q0R_V_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.V */
#define IFX_EVADC_G_Q_Q0R_V_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.V */
#define IFX_EVADC_G_Q_Q0R_V_OFF (8u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.PDD */
#define IFX_EVADC_G_Q_Q0R_PDD_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.PDD */
#define IFX_EVADC_G_Q_Q0R_PDD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.PDD */
#define IFX_EVADC_G_Q_Q0R_PDD_OFF (9u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.MDPD */
#define IFX_EVADC_G_Q_Q0R_MDPD_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.MDPD */
#define IFX_EVADC_G_Q_Q0R_MDPD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.MDPD */
#define IFX_EVADC_G_Q_Q0R_MDPD_OFF (10u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.MDPU */
#define IFX_EVADC_G_Q_Q0R_MDPU_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.MDPU */
#define IFX_EVADC_G_Q_Q0R_MDPU_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.MDPU */
#define IFX_EVADC_G_Q_Q0R_MDPU_OFF (11u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.CDEN */
#define IFX_EVADC_G_Q_Q0R_CDEN_LEN (1u)

