HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEvadc_bf.h
/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.CDEN */
#define IFX_EVADC_G_Q_Q0R_CDEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.CDEN */
#define IFX_EVADC_G_Q_Q0R_CDEN_OFF (12u)

/** \brief Length for Ifx_EVADC_G_Q_Q0R_Bits.CDSEL */
#define IFX_EVADC_G_Q_Q0R_CDSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_Q_Q0R_Bits.CDSEL */
#define IFX_EVADC_G_Q_Q0R_CDSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_Q_Q0R_Bits.CDSEL */
#define IFX_EVADC_G_Q_Q0R_CDSEL_OFF (13u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QINR_REQCHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QINR_REQCHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QINR_REQCHNR_OFF (0u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.RF */
#define IFX_EVADC_G_Q_QINR_RF_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.RF */
#define IFX_EVADC_G_Q_QINR_RF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.RF */
#define IFX_EVADC_G_Q_QINR_RF_OFF (5u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.ENSI */
#define IFX_EVADC_G_Q_QINR_ENSI_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.ENSI */
#define IFX_EVADC_G_Q_QINR_ENSI_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.ENSI */
#define IFX_EVADC_G_Q_QINR_ENSI_OFF (6u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.EXTR */
#define IFX_EVADC_G_Q_QINR_EXTR_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.EXTR */
#define IFX_EVADC_G_Q_QINR_EXTR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.EXTR */
#define IFX_EVADC_G_Q_QINR_EXTR_OFF (7u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.PDD */
#define IFX_EVADC_G_Q_QINR_PDD_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.PDD */
#define IFX_EVADC_G_Q_QINR_PDD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.PDD */
#define IFX_EVADC_G_Q_QINR_PDD_OFF (9u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.MDPD */
#define IFX_EVADC_G_Q_QINR_MDPD_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.MDPD */
#define IFX_EVADC_G_Q_QINR_MDPD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.MDPD */
#define IFX_EVADC_G_Q_QINR_MDPD_OFF (10u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.MDPU */
#define IFX_EVADC_G_Q_QINR_MDPU_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.MDPU */
#define IFX_EVADC_G_Q_QINR_MDPU_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.MDPU */
#define IFX_EVADC_G_Q_QINR_MDPU_OFF (11u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.CDEN */
#define IFX_EVADC_G_Q_QINR_CDEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.CDEN */
#define IFX_EVADC_G_Q_QINR_CDEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.CDEN */
#define IFX_EVADC_G_Q_QINR_CDEN_OFF (12u)

/** \brief Length for Ifx_EVADC_G_Q_QINR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QINR_CDSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_Q_QINR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QINR_CDSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_Q_QINR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QINR_CDSEL_OFF (13u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QBUR_REQCHNR_LEN (5u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QBUR_REQCHNR_MSK (0x1fu)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.REQCHNR */
#define IFX_EVADC_G_Q_QBUR_REQCHNR_OFF (0u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.RF */
#define IFX_EVADC_G_Q_QBUR_RF_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.RF */
#define IFX_EVADC_G_Q_QBUR_RF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.RF */
#define IFX_EVADC_G_Q_QBUR_RF_OFF (5u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.ENSI */
#define IFX_EVADC_G_Q_QBUR_ENSI_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.ENSI */
#define IFX_EVADC_G_Q_QBUR_ENSI_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.ENSI */
#define IFX_EVADC_G_Q_QBUR_ENSI_OFF (6u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.EXTR */
#define IFX_EVADC_G_Q_QBUR_EXTR_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.EXTR */
#define IFX_EVADC_G_Q_QBUR_EXTR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.EXTR */
#define IFX_EVADC_G_Q_QBUR_EXTR_OFF (7u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.V */
#define IFX_EVADC_G_Q_QBUR_V_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.V */
#define IFX_EVADC_G_Q_QBUR_V_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.V */
#define IFX_EVADC_G_Q_QBUR_V_OFF (8u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.PDD */
#define IFX_EVADC_G_Q_QBUR_PDD_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.PDD */
#define IFX_EVADC_G_Q_QBUR_PDD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.PDD */
#define IFX_EVADC_G_Q_QBUR_PDD_OFF (9u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.MDPD */
#define IFX_EVADC_G_Q_QBUR_MDPD_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.MDPD */
#define IFX_EVADC_G_Q_QBUR_MDPD_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.MDPD */
#define IFX_EVADC_G_Q_QBUR_MDPD_OFF (10u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.MDPU */
#define IFX_EVADC_G_Q_QBUR_MDPU_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.MDPU */
#define IFX_EVADC_G_Q_QBUR_MDPU_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.MDPU */
#define IFX_EVADC_G_Q_QBUR_MDPU_OFF (11u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.CDEN */
#define IFX_EVADC_G_Q_QBUR_CDEN_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.CDEN */
#define IFX_EVADC_G_Q_QBUR_CDEN_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.CDEN */
#define IFX_EVADC_G_Q_QBUR_CDEN_OFF (12u)

/** \brief Length for Ifx_EVADC_G_Q_QBUR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QBUR_CDSEL_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_Q_QBUR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QBUR_CDSEL_MSK (0x3u)

/** \brief Offset for Ifx_EVADC_G_Q_QBUR_Bits.CDSEL */
#define IFX_EVADC_G_Q_QBUR_CDSEL_OFF (13u)

/** \brief Length for Ifx_EVADC_G_Q_REQTM_Bits.SEQMOD */
#define IFX_EVADC_G_Q_REQTM_SEQMOD_LEN (2u)

/** \brief Mask for Ifx_EVADC_G_Q_REQTM_Bits.SEQMOD */
#define IFX_EVADC_G_Q_REQTM_SEQMOD_MSK (0x3u)

