HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEvadc_bf.h
/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV2 */
#define IFX_EVADC_G_CEFCLR_CEV2_OFF (2u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV3 */
#define IFX_EVADC_G_CEFCLR_CEV3_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV3 */
#define IFX_EVADC_G_CEFCLR_CEV3_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV3 */
#define IFX_EVADC_G_CEFCLR_CEV3_OFF (3u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV4 */
#define IFX_EVADC_G_CEFCLR_CEV4_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV4 */
#define IFX_EVADC_G_CEFCLR_CEV4_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV4 */
#define IFX_EVADC_G_CEFCLR_CEV4_OFF (4u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV5 */
#define IFX_EVADC_G_CEFCLR_CEV5_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV5 */
#define IFX_EVADC_G_CEFCLR_CEV5_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV5 */
#define IFX_EVADC_G_CEFCLR_CEV5_OFF (5u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV6 */
#define IFX_EVADC_G_CEFCLR_CEV6_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV6 */
#define IFX_EVADC_G_CEFCLR_CEV6_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV6 */
#define IFX_EVADC_G_CEFCLR_CEV6_OFF (6u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV7 */
#define IFX_EVADC_G_CEFCLR_CEV7_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV7 */
#define IFX_EVADC_G_CEFCLR_CEV7_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV7 */
#define IFX_EVADC_G_CEFCLR_CEV7_OFF (7u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV8 */
#define IFX_EVADC_G_CEFCLR_CEV8_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV8 */
#define IFX_EVADC_G_CEFCLR_CEV8_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV8 */
#define IFX_EVADC_G_CEFCLR_CEV8_OFF (8u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV9 */
#define IFX_EVADC_G_CEFCLR_CEV9_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV9 */
#define IFX_EVADC_G_CEFCLR_CEV9_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV9 */
#define IFX_EVADC_G_CEFCLR_CEV9_OFF (9u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV10 */
#define IFX_EVADC_G_CEFCLR_CEV10_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV10 */
#define IFX_EVADC_G_CEFCLR_CEV10_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV10 */
#define IFX_EVADC_G_CEFCLR_CEV10_OFF (10u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV11 */
#define IFX_EVADC_G_CEFCLR_CEV11_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV11 */
#define IFX_EVADC_G_CEFCLR_CEV11_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV11 */
#define IFX_EVADC_G_CEFCLR_CEV11_OFF (11u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV12 */
#define IFX_EVADC_G_CEFCLR_CEV12_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV12 */
#define IFX_EVADC_G_CEFCLR_CEV12_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV12 */
#define IFX_EVADC_G_CEFCLR_CEV12_OFF (12u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV13 */
#define IFX_EVADC_G_CEFCLR_CEV13_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV13 */
#define IFX_EVADC_G_CEFCLR_CEV13_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV13 */
#define IFX_EVADC_G_CEFCLR_CEV13_OFF (13u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV14 */
#define IFX_EVADC_G_CEFCLR_CEV14_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV14 */
#define IFX_EVADC_G_CEFCLR_CEV14_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV14 */
#define IFX_EVADC_G_CEFCLR_CEV14_OFF (14u)

/** \brief Length for Ifx_EVADC_G_CEFCLR_Bits.CEV15 */
#define IFX_EVADC_G_CEFCLR_CEV15_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_CEFCLR_Bits.CEV15 */
#define IFX_EVADC_G_CEFCLR_CEV15_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_CEFCLR_Bits.CEV15 */
#define IFX_EVADC_G_CEFCLR_CEV15_OFF (15u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV0 */
#define IFX_EVADC_G_REFCLR_REV0_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV0 */
#define IFX_EVADC_G_REFCLR_REV0_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV0 */
#define IFX_EVADC_G_REFCLR_REV0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV1 */
#define IFX_EVADC_G_REFCLR_REV1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV1 */
#define IFX_EVADC_G_REFCLR_REV1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV1 */
#define IFX_EVADC_G_REFCLR_REV1_OFF (1u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV2 */
#define IFX_EVADC_G_REFCLR_REV2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV2 */
#define IFX_EVADC_G_REFCLR_REV2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV2 */
#define IFX_EVADC_G_REFCLR_REV2_OFF (2u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV3 */
#define IFX_EVADC_G_REFCLR_REV3_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV3 */
#define IFX_EVADC_G_REFCLR_REV3_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV3 */
#define IFX_EVADC_G_REFCLR_REV3_OFF (3u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV4 */
#define IFX_EVADC_G_REFCLR_REV4_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV4 */
#define IFX_EVADC_G_REFCLR_REV4_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV4 */
#define IFX_EVADC_G_REFCLR_REV4_OFF (4u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV5 */
#define IFX_EVADC_G_REFCLR_REV5_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV5 */
#define IFX_EVADC_G_REFCLR_REV5_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV5 */
#define IFX_EVADC_G_REFCLR_REV5_OFF (5u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV6 */
#define IFX_EVADC_G_REFCLR_REV6_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV6 */
#define IFX_EVADC_G_REFCLR_REV6_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV6 */
#define IFX_EVADC_G_REFCLR_REV6_OFF (6u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV7 */
#define IFX_EVADC_G_REFCLR_REV7_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV7 */
#define IFX_EVADC_G_REFCLR_REV7_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV7 */
#define IFX_EVADC_G_REFCLR_REV7_OFF (7u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV8 */
#define IFX_EVADC_G_REFCLR_REV8_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV8 */
#define IFX_EVADC_G_REFCLR_REV8_MSK (0x1u)

