HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEvadc_bf.h
/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV8 */
#define IFX_EVADC_G_REFCLR_REV8_OFF (8u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV9 */
#define IFX_EVADC_G_REFCLR_REV9_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV9 */
#define IFX_EVADC_G_REFCLR_REV9_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV9 */
#define IFX_EVADC_G_REFCLR_REV9_OFF (9u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV10 */
#define IFX_EVADC_G_REFCLR_REV10_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV10 */
#define IFX_EVADC_G_REFCLR_REV10_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV10 */
#define IFX_EVADC_G_REFCLR_REV10_OFF (10u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV11 */
#define IFX_EVADC_G_REFCLR_REV11_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV11 */
#define IFX_EVADC_G_REFCLR_REV11_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV11 */
#define IFX_EVADC_G_REFCLR_REV11_OFF (11u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV12 */
#define IFX_EVADC_G_REFCLR_REV12_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV12 */
#define IFX_EVADC_G_REFCLR_REV12_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV12 */
#define IFX_EVADC_G_REFCLR_REV12_OFF (12u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV13 */
#define IFX_EVADC_G_REFCLR_REV13_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV13 */
#define IFX_EVADC_G_REFCLR_REV13_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV13 */
#define IFX_EVADC_G_REFCLR_REV13_OFF (13u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV14 */
#define IFX_EVADC_G_REFCLR_REV14_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV14 */
#define IFX_EVADC_G_REFCLR_REV14_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV14 */
#define IFX_EVADC_G_REFCLR_REV14_OFF (14u)

/** \brief Length for Ifx_EVADC_G_REFCLR_Bits.REV15 */
#define IFX_EVADC_G_REFCLR_REV15_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_REFCLR_Bits.REV15 */
#define IFX_EVADC_G_REFCLR_REV15_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_REFCLR_Bits.REV15 */
#define IFX_EVADC_G_REFCLR_REV15_OFF (15u)

/** \brief Length for Ifx_EVADC_G_SEFCLR_Bits.SEV0 */
#define IFX_EVADC_G_SEFCLR_SEV0_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SEFCLR_Bits.SEV0 */
#define IFX_EVADC_G_SEFCLR_SEV0_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SEFCLR_Bits.SEV0 */
#define IFX_EVADC_G_SEFCLR_SEV0_OFF (0u)

/** \brief Length for Ifx_EVADC_G_SEFCLR_Bits.SEV1 */
#define IFX_EVADC_G_SEFCLR_SEV1_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SEFCLR_Bits.SEV1 */
#define IFX_EVADC_G_SEFCLR_SEV1_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SEFCLR_Bits.SEV1 */
#define IFX_EVADC_G_SEFCLR_SEV1_OFF (1u)

/** \brief Length for Ifx_EVADC_G_SEFCLR_Bits.SEV2 */
#define IFX_EVADC_G_SEFCLR_SEV2_LEN (1u)

/** \brief Mask for Ifx_EVADC_G_SEFCLR_Bits.SEV2 */
#define IFX_EVADC_G_SEFCLR_SEV2_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_G_SEFCLR_Bits.SEV2 */
#define IFX_EVADC_G_SEFCLR_SEV2_OFF (2u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_EVADC_G_CEVNP0_CEV0NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_EVADC_G_CEVNP0_CEV0NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV0NP */
#define IFX_EVADC_G_CEVNP0_CEV0NP_OFF (0u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_EVADC_G_CEVNP0_CEV1NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_EVADC_G_CEVNP0_CEV1NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV1NP */
#define IFX_EVADC_G_CEVNP0_CEV1NP_OFF (4u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_EVADC_G_CEVNP0_CEV2NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_EVADC_G_CEVNP0_CEV2NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV2NP */
#define IFX_EVADC_G_CEVNP0_CEV2NP_OFF (8u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_EVADC_G_CEVNP0_CEV3NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_EVADC_G_CEVNP0_CEV3NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV3NP */
#define IFX_EVADC_G_CEVNP0_CEV3NP_OFF (12u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_EVADC_G_CEVNP0_CEV4NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_EVADC_G_CEVNP0_CEV4NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV4NP */
#define IFX_EVADC_G_CEVNP0_CEV4NP_OFF (16u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_EVADC_G_CEVNP0_CEV5NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_EVADC_G_CEVNP0_CEV5NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV5NP */
#define IFX_EVADC_G_CEVNP0_CEV5NP_OFF (20u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_EVADC_G_CEVNP0_CEV6NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_EVADC_G_CEVNP0_CEV6NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV6NP */
#define IFX_EVADC_G_CEVNP0_CEV6NP_OFF (24u)

/** \brief Length for Ifx_EVADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_EVADC_G_CEVNP0_CEV7NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_EVADC_G_CEVNP0_CEV7NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_CEVNP0_Bits.CEV7NP */
#define IFX_EVADC_G_CEVNP0_CEV7NP_OFF (28u)

/** \brief Length for Ifx_EVADC_G_REVNP0_Bits.REV0NP */
#define IFX_EVADC_G_REVNP0_REV0NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP0_Bits.REV0NP */
#define IFX_EVADC_G_REVNP0_REV0NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP0_Bits.REV0NP */
#define IFX_EVADC_G_REVNP0_REV0NP_OFF (0u)

/** \brief Length for Ifx_EVADC_G_REVNP0_Bits.REV1NP */
#define IFX_EVADC_G_REVNP0_REV1NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP0_Bits.REV1NP */
#define IFX_EVADC_G_REVNP0_REV1NP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_G_REVNP0_Bits.REV1NP */
#define IFX_EVADC_G_REVNP0_REV1NP_OFF (4u)

/** \brief Length for Ifx_EVADC_G_REVNP0_Bits.REV2NP */
#define IFX_EVADC_G_REVNP0_REV2NP_LEN (4u)

/** \brief Mask for Ifx_EVADC_G_REVNP0_Bits.REV2NP */
#define IFX_EVADC_G_REVNP0_REV2NP_MSK (0xfu)

